#include <stdlib.h>
#include <stdio.h>
#include <windows.h>
#include <locale.h>

int main(void) {
setlocale(LC_ALL, "Russian");
printf("\
 Привет, семпай) Ты попал в консольную инди хD\n\n \
Что бы выбрать ответ, напиши соответствующую букву в консоль\n\n\
`````````````...``````````````..:```````.-```.``````        `:ymNMMMMMNN.   ````\
``````````../s+..```````.`.``...:.````.``:-``.`.``````      ``+//sdNNNN/   `````\
```````.-+hNNo...............:../-.....-.:/-..........`````````+mmdhdd/`   `````\
``````/hNNNd/...............-/../:....-/.:+/..-..........````````+dNNN+    `````\
``````:mNd+-:-...........-../:.-:/....:+-:/+:.::...........````````:smmo:```````\
```````-+:ohs.......-...-..-:`..:/:...//:-.//...-............```...-.-/ymds:.```\
````...:yNd+-..-...--...---:...-/-:.../-:-`./:-.`-...--........``..+hhysoshd+```\
``.../ymNs:-..:-.../...-/.-:::/:/:-..-:`--::::-.``....--......-..`..-omNNNy-````\
...+dNNd/--.-:/...:/...:o-+shhhys:...-``.--:-...--`...--......-/-...---ody``````\
..sNNNy:-:--:+:..-/-.--/y-./yhMdy-`..``````-/+++oo//-.-.-......++/-.--..--``````\
..-:o/-:/:-:+:-..:--..-++:``/:s/s`````````.--```````..-..-.....++++---..``...```\
....-:++---+:-..--.-..-/..``--``.```````````````````-.-...-...-+ooo+:--...``````\
...-------/:--..-..-..-/.````````````.``````````````:--....-..-+oooo+://-..`````\
.````.----/-:-.--...-.-/:````````````.`````````````-/:.....----+oooo+/://:-..```\
.````.---/::/---....--:++/.```````````````````````-+o--...--/--ooooo:-::----..``\
..``.----+++----------/ooo+.`````````````````````-+oo-------+::oo/:++:```.......\
```..---+oo/---:------/+oooo:.`````````````````./osoo----.--/+/oo+``-//.````````\
```.-:/++/--..--------::/+oooo/-.````````````.:hmdyo/----`-.`-/ooo-```.-.```````\
``-://:-``..``--------::::/+osydm/-.``````.-://NMMMmo---.`-.```-/++`````````````\
.:::..````.```-----:--::::::/mMMMy//:-..-:///+sNMMMMo--:-`-``````.//```````-....\
:-::-```.-.```.----::-::::::/mMMMNyso+/+osydmNMMMMMh:-::-.--.````.`..``````-::::\
:::-.--:::`.------:::-:::::::/dmNMNmmNNNNNmmmNNMMMMy-::::::::.-`.----.```...::::");
sleep(7);
system("cls");
printf("Давным давно, в далекой галактике...\nАлиса Еотова пекла пироги\nИтак, какой пирожок Алисы выберешь и сьешь ты?\
\n\n");
printf("A: C говном    B: C Патриотизмом    С: С Подвохом\n\n");
char Q1, Name[20], Win[7]="Astolfo";
scanf("%c", &Q1 );
switch(Q1){
	case 'A':
		printf("Поздравляю, ты пожрал говна");
		return EXIT_SUCCESS;
	case 'B':
		printf("*Начинает играть Гимн хохлостана*");
	case 'C':
		printf("\nХороший выбор) Ты начинаешь мне нравится)\n");
		printf("\nКак тебя зовут?\n\n");
		scanf("%s", &Name );
		printf("\nПрекрасное имя, %s. ^-^", Name);
		if (strcmp(Name, Win)==0) {
			printf("\nТы сильнее меня...");
		}
		
}
printf("\n\n");
system("pause");
 
return EXIT_SUCCESS;
}

